In [4]:
import os
from openai import OpenAI
from dotenv import load_dotenv

if load_dotenv('./src/env', override=True):
    print("Encotrado .env file")
    DBHOST = os.getenv('DBHOST')
    DBPORT = os.getenv('DBPORT')
    DBNAME = os.getenv('DBNAME')
    DBUSER = os.getenv('DBUSER')
    DBPASSWORD = os.getenv('DBPASSWORD')

    connection_url = f'mysql+pymysql://{DBUSER}:{DBPASSWORD}@{DBHOST}:{DBPORT}/{DBNAME}'
    
    client = OpenAI(
        api_key = os.getenv("GEMINI_API_KEY"),
        base_url= os.getenv("BASE_URL")
        )

Encotrado .env file

In [5]:
%load_ext sql

In [6]:
%sql {connection_url}

In [7]:
%sql

 * mysql+pymysql://root:***@localhost:3306/sakila

In [8]:
%sql SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/sakila
23 rows affected.

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

In [10]:
tablas = %sql SHOW TABLES;
tablas = [tabla[0] for tabla in tablas]

 * mysql+pymysql://root:***@localhost:3306/sakila
23 rows affected.

In [11]:
tablas

['actor',
 'actor_info',
 'address',
 'category',
 'city',
 'country',
 'customer',
 'customer_list',
 'film',
 'film_actor',
 'film_category',
 'film_list',
 'film_text',
 'inventory',
 'language',
 'nicer_but_slower_film_list',
 'payment',
 'rental',
 'sales_by_film_category',
 'sales_by_store',
 'staff',
 'staff_list',
 'store']

In [12]:
%sql SHOW CREATE TABLE {tablas[0]}

 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.

[('actor', 'CREATE TABLE `actor` (\n  `actor_id` smallint unsigned NOT NULL AUTO_INCREMENT,\n  `first_name` varchar(45) NOT NULL,\n  `last_name` varchar(45) NOT  ... (79 characters truncated) ... URRENT_TIMESTAMP,\n  PRIMARY KEY (`actor_id`),\n  KEY `idx_actor_last_name` (`last_name`)\n) ENGINE=InnoDB AUTO_INCREMENT=201 DEFAULT CHARSET=utf8mb3')]

In [13]:
esquema = ""
for tabla in tablas:
    result = %sql SHOW CREATE TABLE {tabla}
    esquema += result[0][1]  # el SQL está en la segunda columna
    esquema += "\n" + "-"*80 + "\n"

 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.

In [14]:
print(esquema)

CREATE TABLE `actor` (
  `actor_id` smallint unsigned NOT NULL AUTO_INCREMENT,
  `first_name` varchar(45) NOT NULL,
  `last_name` varchar(45) NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`actor_id`),
  KEY `idx_actor_last_name` (`last_name`)
) ENGINE=InnoDB AUTO_INCREMENT=201 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY INVOKER VIEW `actor_info` AS select `a`.`actor_id` AS `actor_id`,`a`.`first_name` AS `first_name`,`a`.`last_name` AS `last_name`,group_concat(distinct concat(`c`.`name`,': ',(select group_concat(`f`.`title` order by `f`.`title` ASC separator ', ') from ((`film` `f` join `film_category` `fc` on((`f`.`film_id` = `fc`.`film_id`))) join `film_actor` `fa` on((`f`.`film_id` = `fa`.`film_id`))) where ((`fc`.`category_id` = `c`.`category_id`) and (`fa`.`actor_id` = `a`.`actor_id`)))) order by `c`.`name` ASC separator '; ') AS `film_info` from (((`actor` `a` left join `film_actor` `fa` on((`a`.`actor_id` = `fa`.`actor_id`))) left join `film_category` `fc` on((`fa`.`film_id` = `fc`.`film_id`))) left join `category` `c` on((`fc`.`category_id` = `c`.`category_id`))) group by `a`.`actor_id`,`a`.`first_name`,`a`.`last_name`
--------------------------------------------------------------------------------
CREATE TABLE `address` (
  `address_id` smallint unsigned NOT NULL AUTO_INCREMENT,
  `address` varchar(50) NOT NULL,
  `address2` varchar(50) DEFAULT NULL,
  `district` varchar(20) NOT NULL,
  `city_id` smallint unsigned NOT NULL,
  `postal_code` varchar(10) DEFAULT NULL,
  `phone` varchar(20) NOT NULL,
  `location` geometry NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`address_id`),
  KEY `idx_fk_city_id` (`city_id`),
  SPATIAL KEY `idx_location` (`location`),
  CONSTRAINT `fk_address_city` FOREIGN KEY (`city_id`) REFERENCES `city` (`city_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=606 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `category` (
  `category_id` tinyint unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(25) NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `city` (
  `city_id` smallint unsigned NOT NULL AUTO_INCREMENT,
  `city` varchar(50) NOT NULL,
  `country_id` smallint unsigned NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`city_id`),
  KEY `idx_fk_country_id` (`country_id`),
  CONSTRAINT `fk_city_country` FOREIGN KEY (`country_id`) REFERENCES `country` (`country_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=601 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `country` (
  `country_id` smallint unsigned NOT NULL AUTO_INCREMENT,
  `country` varchar(50) NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`country_id`)
) ENGINE=InnoDB AUTO_INCREMENT=110 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `customer` (
  `customer_id` smallint unsigned NOT NULL AUTO_INCREMENT,
  `store_id` tinyint unsigned NOT NULL,
  `first_name` varchar(45) NOT NULL,
  `last_name` varchar(45) NOT NULL,
  `email` varchar(50) DEFAULT NULL,
  `address_id` smallint unsigned NOT NULL,
  `active` tinyint(1) NOT NULL DEFAULT '1',
  `create_date` datetime NOT NULL,
  `last_update` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`customer_id`),
  KEY `idx_fk_store_id` (`store_id`),
  KEY `idx_fk_address_id` (`address_id`),
  KEY `idx_last_name` (`last_name`),
  CONSTRAINT `fk_customer_address` FOREIGN KEY (`address_id`) REFERENCES `address` (`address_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_customer_store` FOREIGN KEY (`store_id`) REFERENCES `store` (`store_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=600 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `customer_list` AS select `cu`.`customer_id` AS `ID`,concat(`cu`.`first_name`,_utf8mb3' ',`cu`.`last_name`) AS `name`,`a`.`address` AS `address`,`a`.`postal_code` AS `zip code`,`a`.`phone` AS `phone`,`city`.`city` AS `city`,`country`.`country` AS `country`,if(`cu`.`active`,_utf8mb3'active',_utf8mb3'') AS `notes`,`cu`.`store_id` AS `SID` from (((`customer` `cu` join `address` `a` on((`cu`.`address_id` = `a`.`address_id`))) join `city` on((`a`.`city_id` = `city`.`city_id`))) join `country` on((`city`.`country_id` = `country`.`country_id`)))
--------------------------------------------------------------------------------
CREATE TABLE `film` (
  `film_id` smallint unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `description` text,
  `release_year` year DEFAULT NULL,
  `language_id` tinyint unsigned NOT NULL,
  `original_language_id` tinyint unsigned DEFAULT NULL,
  `rental_duration` tinyint unsigned NOT NULL DEFAULT '3',
  `rental_rate` decimal(4,2) NOT NULL DEFAULT '4.99',
  `length` smallint unsigned DEFAULT NULL,
  `replacement_cost` decimal(5,2) NOT NULL DEFAULT '19.99',
  `rating` enum('G','PG','PG-13','R','NC-17') DEFAULT 'G',
  `special_features` set('Trailers','Commentaries','Deleted Scenes','Behind the Scenes') DEFAULT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`film_id`),
  KEY `idx_title` (`title`),
  KEY `idx_fk_language_id` (`language_id`),
  KEY `idx_fk_original_language_id` (`original_language_id`),
  CONSTRAINT `fk_film_language` FOREIGN KEY (`language_id`) REFERENCES `language` (`language_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_film_language_original` FOREIGN KEY (`original_language_id`) REFERENCES `language` (`language_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=1001 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `film_actor` (
  `actor_id` smallint unsigned NOT NULL,
  `film_id` smallint unsigned NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`actor_id`,`film_id`),
  KEY `idx_fk_film_id` (`film_id`),
  CONSTRAINT `fk_film_actor_actor` FOREIGN KEY (`actor_id`) REFERENCES `actor` (`actor_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_film_actor_film` FOREIGN KEY (`film_id`) REFERENCES `film` (`film_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `film_category` (
  `film_id` smallint unsigned NOT NULL,
  `category_id` tinyint unsigned NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`film_id`,`category_id`),
  KEY `fk_film_category_category` (`category_id`),
  CONSTRAINT `fk_film_category_category` FOREIGN KEY (`category_id`) REFERENCES `category` (`category_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_film_category_film` FOREIGN KEY (`film_id`) REFERENCES `film` (`film_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `film_list` AS select `film`.`film_id` AS `FID`,`film`.`title` AS `title`,`film`.`description` AS `description`,`category`.`name` AS `category`,`film`.`rental_rate` AS `price`,`film`.`length` AS `length`,`film`.`rating` AS `rating`,group_concat(concat(`actor`.`first_name`,_utf8mb3' ',`actor`.`last_name`) separator ', ') AS `actors` from ((((`category` left join `film_category` on((`category`.`category_id` = `film_category`.`category_id`))) left join `film` on((`film_category`.`film_id` = `film`.`film_id`))) join `film_actor` on((`film`.`film_id` = `film_actor`.`film_id`))) join `actor` on((`film_actor`.`actor_id` = `actor`.`actor_id`))) group by `film`.`film_id`,`category`.`name`
--------------------------------------------------------------------------------
CREATE TABLE `film_text` (
  `film_id` smallint NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text,
  PRIMARY KEY (`film_id`),
  FULLTEXT KEY `idx_title_description` (`title`,`description`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `inventory` (
  `inventory_id` mediumint unsigned NOT NULL AUTO_INCREMENT,
  `film_id` smallint unsigned NOT NULL,
  `store_id` tinyint unsigned NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`inventory_id`),
  KEY `idx_fk_film_id` (`film_id`),
  KEY `idx_store_id_film_id` (`store_id`,`film_id`),
  CONSTRAINT `fk_inventory_film` FOREIGN KEY (`film_id`) REFERENCES `film` (`film_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_inventory_store` FOREIGN KEY (`store_id`) REFERENCES `store` (`store_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=4582 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `language` (
  `language_id` tinyint unsigned NOT NULL AUTO_INCREMENT,
  `name` char(20) NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`language_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `nicer_but_slower_film_list` AS select `film`.`film_id` AS `FID`,`film`.`title` AS `title`,`film`.`description` AS `description`,`category`.`name` AS `category`,`film`.`rental_rate` AS `price`,`film`.`length` AS `length`,`film`.`rating` AS `rating`,group_concat(concat(concat(upper(substr(`actor`.`first_name`,1,1)),lower(substr(`actor`.`first_name`,2,length(`actor`.`first_name`))),_utf8mb3' ',concat(upper(substr(`actor`.`last_name`,1,1)),lower(substr(`actor`.`last_name`,2,length(`actor`.`last_name`)))))) separator ', ') AS `actors` from ((((`category` left join `film_category` on((`category`.`category_id` = `film_category`.`category_id`))) left join `film` on((`film_category`.`film_id` = `film`.`film_id`))) join `film_actor` on((`film`.`film_id` = `film_actor`.`film_id`))) join `actor` on((`film_actor`.`actor_id` = `actor`.`actor_id`))) group by `film`.`film_id`,`category`.`name`
--------------------------------------------------------------------------------
CREATE TABLE `payment` (
  `payment_id` smallint unsigned NOT NULL AUTO_INCREMENT,
  `customer_id` smallint unsigned NOT NULL,
  `staff_id` tinyint unsigned NOT NULL,
  `rental_id` int DEFAULT NULL,
  `amount` decimal(5,2) NOT NULL,
  `payment_date` datetime NOT NULL,
  `last_update` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`payment_id`),
  KEY `idx_fk_staff_id` (`staff_id`),
  KEY `idx_fk_customer_id` (`customer_id`),
  KEY `fk_payment_rental` (`rental_id`),
  CONSTRAINT `fk_payment_customer` FOREIGN KEY (`customer_id`) REFERENCES `customer` (`customer_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_payment_rental` FOREIGN KEY (`rental_id`) REFERENCES `rental` (`rental_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `fk_payment_staff` FOREIGN KEY (`staff_id`) REFERENCES `staff` (`staff_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=16050 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE TABLE `rental` (
  `rental_id` int NOT NULL AUTO_INCREMENT,
  `rental_date` datetime NOT NULL,
  `inventory_id` mediumint unsigned NOT NULL,
  `customer_id` smallint unsigned NOT NULL,
  `return_date` datetime DEFAULT NULL,
  `staff_id` tinyint unsigned NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`rental_id`),
  UNIQUE KEY `rental_date` (`rental_date`,`inventory_id`,`customer_id`),
  KEY `idx_fk_inventory_id` (`inventory_id`),
  KEY `idx_fk_customer_id` (`customer_id`),
  KEY `idx_fk_staff_id` (`staff_id`),
  CONSTRAINT `fk_rental_customer` FOREIGN KEY (`customer_id`) REFERENCES `customer` (`customer_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_rental_inventory` FOREIGN KEY (`inventory_id`) REFERENCES `inventory` (`inventory_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_rental_staff` FOREIGN KEY (`staff_id`) REFERENCES `staff` (`staff_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=16050 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `sales_by_film_category` AS select `c`.`name` AS `category`,sum(`p`.`amount`) AS `total_sales` from (((((`payment` `p` join `rental` `r` on((`p`.`rental_id` = `r`.`rental_id`))) join `inventory` `i` on((`r`.`inventory_id` = `i`.`inventory_id`))) join `film` `f` on((`i`.`film_id` = `f`.`film_id`))) join `film_category` `fc` on((`f`.`film_id` = `fc`.`film_id`))) join `category` `c` on((`fc`.`category_id` = `c`.`category_id`))) group by `c`.`name` order by `total_sales` desc
--------------------------------------------------------------------------------
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `sales_by_store` AS select concat(`c`.`city`,_utf8mb3',',`cy`.`country`) AS `store`,concat(`m`.`first_name`,_utf8mb3' ',`m`.`last_name`) AS `manager`,sum(`p`.`amount`) AS `total_sales` from (((((((`payment` `p` join `rental` `r` on((`p`.`rental_id` = `r`.`rental_id`))) join `inventory` `i` on((`r`.`inventory_id` = `i`.`inventory_id`))) join `store` `s` on((`i`.`store_id` = `s`.`store_id`))) join `address` `a` on((`s`.`address_id` = `a`.`address_id`))) join `city` `c` on((`a`.`city_id` = `c`.`city_id`))) join `country` `cy` on((`c`.`country_id` = `cy`.`country_id`))) join `staff` `m` on((`s`.`manager_staff_id` = `m`.`staff_id`))) group by `s`.`store_id` order by `cy`.`country`,`c`.`city`
--------------------------------------------------------------------------------
CREATE TABLE `staff` (
  `staff_id` tinyint unsigned NOT NULL AUTO_INCREMENT,
  `first_name` varchar(45) NOT NULL,
  `last_name` varchar(45) NOT NULL,
  `address_id` smallint unsigned NOT NULL,
  `picture` blob,
  `email` varchar(50) DEFAULT NULL,
  `store_id` tinyint unsigned NOT NULL,
  `active` tinyint(1) NOT NULL DEFAULT '1',
  `username` varchar(16) NOT NULL,
  `password` varchar(40) CHARACTER SET utf8mb3 COLLATE utf8_bin DEFAULT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`staff_id`),
  KEY `idx_fk_store_id` (`store_id`),
  KEY `idx_fk_address_id` (`address_id`),
  CONSTRAINT `fk_staff_address` FOREIGN KEY (`address_id`) REFERENCES `address` (`address_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_staff_store` FOREIGN KEY (`store_id`) REFERENCES `store` (`store_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `staff_list` AS select `s`.`staff_id` AS `ID`,concat(`s`.`first_name`,_utf8mb3' ',`s`.`last_name`) AS `name`,`a`.`address` AS `address`,`a`.`postal_code` AS `zip code`,`a`.`phone` AS `phone`,`city`.`city` AS `city`,`country`.`country` AS `country`,`s`.`store_id` AS `SID` from (((`staff` `s` join `address` `a` on((`s`.`address_id` = `a`.`address_id`))) join `city` on((`a`.`city_id` = `city`.`city_id`))) join `country` on((`city`.`country_id` = `country`.`country_id`)))
--------------------------------------------------------------------------------
CREATE TABLE `store` (
  `store_id` tinyint unsigned NOT NULL AUTO_INCREMENT,
  `manager_staff_id` tinyint unsigned NOT NULL,
  `address_id` smallint unsigned NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`store_id`),
  UNIQUE KEY `idx_unique_manager` (`manager_staff_id`),
  KEY `idx_fk_address_id` (`address_id`),
  CONSTRAINT `fk_store_address` FOREIGN KEY (`address_id`) REFERENCES `address` (`address_id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `fk_store_staff` FOREIGN KEY (`manager_staff_id`) REFERENCES `staff` (`staff_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb3
--------------------------------------------------------------------------------

In [15]:
def consulta(pregunta, esq=esquema):
    prompt_sys = f"""
eres un experto en consultas de sql, aca tenes la informacion de la base a trabajar
{esq}
Solo debes devolver la consulta sql sin agregar ningun comentario
"""
    response =  client.chat.completions.create(
        model = "gemini-2.0-flash",
        messages = [{
            "role": "system",
            "content": prompt_sys},
        {
            "role": "user",
            "content": f"Genera una query sql que reuelva lo siguiente : {pregunta}"
        }
        ])
    return response.choices[0].message.content.replace("```sql", "").replace("```", "")

In [16]:
sql = consulta("""necesito los 10 actores el nombre apellido y pelicula 
de las 10 peliculas mas existosas, solo 20 registros """)

In [17]:
%sql {sql}

 * mysql+pymysql://root:***@localhost:3306/sakila
20 rows affected.

[('WOODY', 'HOFFMAN', 'TELEGRAPH VOYAGE'),
 ('CARMEN', 'HUNT', 'TELEGRAPH VOYAGE'),
 ('GINA', 'DEGENERES', 'TELEGRAPH VOYAGE'),
 ('LUCILLE', 'DEE', 'TELEGRAPH VOYAGE'),
 ('VIVIEN', 'BASINGER', 'TELEGRAPH VOYAGE'),
 ('MICHAEL', 'BENING', 'TELEGRAPH VOYAGE'),
 ('THORA', 'TEMPLE', 'TELEGRAPH VOYAGE'),
 ('WOODY', 'HOFFMAN', 'WIFE TURN'),
 ('JULIA', 'BARRYMORE', 'WIFE TURN'),
 ('GINA', 'DEGENERES', 'WIFE TURN'),
 ('CAMERON', 'ZELLWEGER', 'WIFE TURN'),
 ('GRETA', 'MALDEN', 'WIFE TURN'),
 ('MICHAEL', 'BOLGER', 'WIFE TURN'),
 ('IAN', 'TANDY', 'ZORRO ARK'),
 ('NICK', 'DEGENERES', 'ZORRO ARK'),
 ('LISA', 'MONROE', 'ZORRO ARK'),
 ('NICK', 'WAHLBERG', 'GOODFELLAS SALUTE'),
 ('JOHNNY', 'LOLLOBRIGIDA', 'GOODFELLAS SALUTE'),
 ('ELVIS', 'MARX', 'GOODFELLAS SALUTE'),
 ('BEN', 'WILLIS', 'GOODFELLAS SALUTE')]

In [18]:
print(sql)

SELECT
    a.first_name,
    a.last_name,
    f.title AS film_title
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.film_id IN (
    SELECT film_id
    FROM (
        SELECT
            f.film_id,
            SUM(p.amount) AS total_revenue
        FROM film f
        JOIN inventory i ON f.film_id = i.film_id
        JOIN rental r ON i.inventory_id = r.inventory_id
        JOIN payment p ON r.rental_id = p.rental_id
        GROUP BY f.film_id
        ORDER BY total_revenue DESC
        LIMIT 10
    ) AS top_films
)
LIMIT 20;

In [15]:
print(sql)

SELECT
    act.first_name,
    act.last_name,
    f.title AS movie_title
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_actor fa ON f.film_id = fa.film_id
JOIN actor act ON fa.actor_id = act.actor_id
GROUP BY act.actor_id, f.film_id
ORDER BY SUM(p.amount) DESC
LIMIT 20;

In [23]:
%%sql Explain
SELECT 
    act.first_name,
    act.last_name,
    f.title AS movie_title
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_actor fa ON f.film_id = fa.film_id
JOIN actor act ON fa.actor_id = act.actor_id
GROUP BY act.actor_id, f.film_id
ORDER BY SUM(p.amount) DESC
LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/sakila
6 rows affected.

[(1, 'SIMPLE', 'f', None, 'index', 'PRIMARY', 'idx_title', '767', None, 1000, 100.0, 'Using index; Using temporary; Using filesort'),
 (1, 'SIMPLE', 'i', None, 'ref', 'PRIMARY,idx_fk_film_id', 'idx_fk_film_id', '2', 'sakila.f.film_id', 4, 100.0, 'Using index'),
 (1, 'SIMPLE', 'r', None, 'ref', 'PRIMARY,idx_fk_inventory_id', 'idx_fk_inventory_id', '3', 'sakila.i.inventory_id', 3, 100.0, 'Using index'),
 (1, 'SIMPLE', 'p', None, 'ref', 'fk_payment_rental', 'fk_payment_rental', '5', 'sakila.r.rental_id', 1, 100.0, None),
 (1, 'SIMPLE', 'fa', None, 'ref', 'PRIMARY,idx_fk_film_id', 'idx_fk_film_id', '2', 'sakila.f.film_id', 5, 100.0, 'Using index'),
 (1, 'SIMPLE', 'act', None, 'eq_ref', 'PRIMARY', 'PRIMARY', '2', 'sakila.fa.actor_id', 1, 100.0, None)]

In [24]:
%%sql Explain
SELECT 
    act.first_name,
    act.last_name,
    f.title AS movie_title
FROM actor act
JOIN film_actor fa ON act.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
JOIN (
    SELECT 
        f.film_id,
        SUM(p.amount) AS total_revenue
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    JOIN payment p ON r.rental_id = p.rental_id
    GROUP BY f.film_id
    ORDER BY total_revenue DESC
    LIMIT 10
) AS top_movies ON f.film_id = top_movies.film_id
LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/sakila
8 rows affected.

[(1, 'PRIMARY', '<derived2>', None, 'ALL', None, None, None, None, 10, 100.0, None),
 (1, 'PRIMARY', 'f', None, 'eq_ref', 'PRIMARY', 'PRIMARY', '2', 'top_movies.film_id', 1, 100.0, None),
 (1, 'PRIMARY', 'fa', None, 'ref', 'PRIMARY,idx_fk_film_id', 'idx_fk_film_id', '2', 'top_movies.film_id', 5, 100.0, 'Using index'),
 (1, 'PRIMARY', 'act', None, 'eq_ref', 'PRIMARY', 'PRIMARY', '2', 'sakila.fa.actor_id', 1, 100.0, None),
 (2, 'DERIVED', 'f', None, 'index', 'PRIMARY,idx_title,idx_fk_language_id,idx_fk_original_language_id', 'PRIMARY', '2', None, 1000, 100.0, 'Using index; Using temporary; Using filesort'),
 (2, 'DERIVED', 'i', None, 'ref', 'PRIMARY,idx_fk_film_id', 'idx_fk_film_id', '2', 'sakila.f.film_id', 4, 100.0, 'Using index'),
 (2, 'DERIVED', 'r', None, 'ref', 'PRIMARY,idx_fk_inventory_id', 'idx_fk_inventory_id', '3', 'sakila.i.inventory_id', 3, 100.0, 'Using index'),
 (2, 'DERIVED', 'p', None, 'ref', 'fk_payment_rental', 'fk_payment_rental', '5', 'sakila.r.rental_id', 1, 100.0, None)]

In [19]:
ejercicio_1= """
Escribe una consulta SQL para crear una réplica de la tabla `category` llamada `category_copy`. 
Utiliza estas columnas:

- category_id:
  - entero
- name: 
  - texto no mas de 25 caracetes no nulo 
- last_update:
  - fecha y hora no nulo
"""

In [22]:
sql_1=consulta(ejercicio_1)
print(consulta(sql_1))
%sql {sql_1}

CREATE TABLE category_copy (
  category_id INT,
  name VARCHAR(25) NOT NULL,
  last_update DATETIME NOT NULL
);

 * mysql+pymysql://root:***@localhost:3306/sakila
0 rows affected.

[]

In [23]:
ejercicio_2 = consulta("""
Escribe una consulta SQL para recuperar el título como PELICULA, duración como DURACION y año como LANZAMIENTO 
de la tabla `film`. 
Limita la salida a solo 10 registros.""")
print(ejercicio_2)

%sql {ejercicio_2}

SELECT
    title AS PELICULA,
    length AS DURACION,
    release_year AS LANZAMIENTO
FROM
    film
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/sakila
10 rows affected.

[('ACADEMY DINOSAUR', 86, 2006),
 ('ACE GOLDFINGER', 48, 2006),
 ('ADAPTATION HOLES', 50, 2006),
 ('AFFAIR PREJUDICE', 117, 2006),
 ('AFRICAN EGG', 130, 2006),
 ('AGENT TRUMAN', 169, 2006),
 ('AIRPLANE SIERRA', 62, 2006),
 ('AIRPORT POLLOCK', 54, 2006),
 ('ALABAMA DEVIL', 114, 2006),
 ('ALADDIN CALENDAR', 63, 2006)]

In [24]:
ejercicio_3=consulta("""Escribe una consulta SQL para obtener todas las columnas de la tabla de tiendas.""")
print(ejercicio_3)

%sql {ejercicio_3}

SELECT * FROM store;

 * mysql+pymysql://root:***@localhost:3306/sakila
2 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 4, 57, 12)),
 (2, 2, 2, datetime.datetime(2006, 2, 15, 4, 57, 12))]

In [25]:
ejercicio_4=consulta("""Escribe una consulta SQL para recuperar el nombre, apellido y correo electrónico de cada miembro 
del personal `activo` de la tabla `staff`.""")
print(ejercicio_4)

%sql {ejercicio_4}

SELECT first_name, last_name, email
FROM staff
WHERE active = 1;

 * mysql+pymysql://root:***@localhost:3306/sakila
2 rows affected.

[('Mike', 'Hillyer', 'Mike.Hillyer@sakilastaff.com'),
 ('Jon', 'Stephens', 'Jon.Stephens@sakilastaff.com')]

In [26]:
ej_5=consulta("""
Escribe una consulta SQL para insertar las siguientes 
filas en la tabla `category_copy`:

| **category_id** | **name**  | **last_update**         |
| --------------- | --------- | ----------------------- |
| 1               | Horror    | 2006-02-15 09:46:27.000 |
| 10              | Animation | 2006-02-15 09:46:27.000 |
| 20              | Pop       | 2006-02-15 09:46:27.000 |
""")
print(ej_5)

%sql {ej_5}

INSERT INTO category_copy (category_id, name, last_update)
VALUES
(1, 'Horror', '2006-02-15 09:46:27.000'),
(10, 'Animation', '2006-02-15 09:46:27.000'),
(20, 'Pop', '2006-02-15 09:46:27.000');

 * mysql+pymysql://root:***@localhost:3306/sakila
3 rows affected.

[]

In [27]:
%%sql
SELECT *
FROM category_copy;

 * mysql+pymysql://root:***@localhost:3306/sakila
3 rows affected.

[(1, 'Horror', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (10, 'Animation', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (20, 'Pop', datetime.datetime(2006, 2, 15, 9, 46, 27))]

In [29]:
EJ_6=consulta("""Escribe una consulta SQL para realizar los siguientes cambios en la tabla `category_copy`:

- Cambiar el valor de `last_update` a `2020-09-12 08:00:00.000` para todas las filas.
- Cambiar el valor de `category_id` a `2` para la fila con el `name` de `Animation`.
- Cambiar el valor de `name` a `Action` para la fila con el `category_id` de `1`.

te recuerdo que creamos la tabla category_copy 
con las siguientes columnas:
| **category_id** | **name**  | **last_update**         |
| --------------- | --------- | ----------------------- |
| 1               | Horror    | 2006-02-15 09:46:27.000 |
| 10              | Animation | 2006-02-15 09:46:27.000 |
| 20              | Pop       | 2006-02-15 09:46:27.000 |
""")

print(EJ_6)

UPDATE category_copy
SET last_update = '2020-09-12 08:00:00.000';

UPDATE category_copy
SET category_id = 2
WHERE name = 'Animation';

UPDATE category_copy
SET name = 'Action'
WHERE category_id = 1;

In [30]:
%sql {EJ_6}

 * mysql+pymysql://root:***@localhost:3306/sakila
3 rows affected.
1 rows affected.
1 rows affected.

[]

In [31]:
%%sql
SELECT *
FROM category_copy;

 * mysql+pymysql://root:***@localhost:3306/sakila
3 rows affected.

[(1, 'Action', datetime.datetime(2020, 9, 12, 8, 0)),
 (2, 'Animation', datetime.datetime(2020, 9, 12, 8, 0)),
 (20, 'Pop', datetime.datetime(2020, 9, 12, 8, 0))]

In [32]:
ej_7=consulta("""
Escribe una consulta SQL para eliminar la fila donde el 
`category_id` es `20` de la tabla `category_copy`.
ya existe la tabla category_copy con las siguientes columnas:  
1	Action	2020-09-12 08:00:00
2	Animation	2020-09-12 08:00:00
20	Pop	2020-09-12 08:00:00
              """)

In [34]:
print(ej_7)

DELETE FROM category_copy WHERE category_id = 20;

In [ ]:
%%sql

{ej_7};

 * mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.
(pymysql.err.OperationalError) (1065, 'Query was empty')
[SQL: ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [36]:
%%sql

SELECT *
FROM category_copy;

 * mysql+pymysql://root:***@localhost:3306/sakila
2 rows affected.

[(1, 'Action', datetime.datetime(2020, 9, 12, 8, 0)),
 (2, 'Animation', datetime.datetime(2020, 9, 12, 8, 0))]

In [39]:
ej_8=consulta("""
Escribe una consulta SQL para obtener 10 filas del título, 
la duración y el año de lanzamiento de la tabla `film`. 
Cambia los nombres de las columnas 
para que tengan `film_` como prefijo.""")

print(ej_8)

SELECT
    title AS film_title,
    length AS film_length,
    release_year AS film_release_year
FROM
    film
LIMIT 10;

In [40]:
%sql {ej_8}

 * mysql+pymysql://root:***@localhost:3306/sakila
10 rows affected.

[('ACADEMY DINOSAUR', 86, 2006),
 ('ACE GOLDFINGER', 48, 2006),
 ('ADAPTATION HOLES', 50, 2006),
 ('AFFAIR PREJUDICE', 117, 2006),
 ('AFRICAN EGG', 130, 2006),
 ('AGENT TRUMAN', 169, 2006),
 ('AIRPLANE SIERRA', 62, 2006),
 ('AIRPORT POLLOCK', 54, 2006),
 ('ALABAMA DEVIL', 114, 2006),
 ('ALADDIN CALENDAR', 63, 2006)]

In [43]:
ej_9=consulta("""
Escribe una consulta SQL para obtener solo 5 filas con: 
ciudad, 
dirección y 
distrito de cada dirección en la tabla `address`.""")

print(ej_9)

SELECT city.city, address.address, address.district
FROM address
JOIN city ON address.city_id = city.city_id
LIMIT 5;

In [44]:
%sql {ej_9}

 * mysql+pymysql://root:***@localhost:3306/sakila
5 rows affected.

[('A Corua (La Corua)', '939 Probolinggo Loop', 'Galicia'),
 ('Abha', '733 Mandaluyong Place', 'Asir'),
 ('Abu Dhabi', '535 Ahmadnagar Manor', 'Abu Dhabi'),
 ('Acua', '1789 Saint-Denis Parkway', 'Coahuila de Zaragoza'),
 ('Adana', '663 Baha Blanca Parkway', 'Adana')]

In [45]:
ej_10 = consulta("""
Escribe una consulta SQL para obtener 
el país, 
la ciudad y 
la dirección de los 
miembros del personal activos.""")
print(ej_10)

SELECT
    c.country,
    city.city,
    a.address
FROM
    staff AS s
JOIN
    address AS a ON s.address_id = a.address_id
JOIN
    city ON a.city_id = city.city_id
JOIN
    country AS c ON city.country_id = c.country_id
WHERE
    s.active = 1;

In [46]:
%sql {ej_10}

 * mysql+pymysql://root:***@localhost:3306/sakila
2 rows affected.

[('Canada', 'Lethbridge', '23 Workhaven Lane'),
 ('Australia', 'Woodridge', '1411 Lillydale Drive')]

In [47]:
ej_11= consulta("""
Escribe una consulta SQL para recuperar el 
número de películas por 
clasificación en la tabla `film`.""")
print(ej_11)

SELECT rating, COUNT(*) AS number_of_films
FROM film
GROUP BY rating;

In [49]:
%sql {ej_11}

 * mysql+pymysql://root:***@localhost:3306/sakila
5 rows affected.

[('PG', 194), ('G', 178), ('NC-17', 210), ('PG-13', 223), ('R', 195)]

In [50]:
ej_12= consulta("""
Escribe una consulta SQL para obtener el 
número de películas por categoría. 
Ordena los resultados por el número de películas en 
orden ascendente.""")

print(ej_12)

SELECT
    c.name AS category_name,
    COUNT(fc.film_id) AS number_of_films
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
GROUP BY c.name
ORDER BY number_of_films ASC;

In [51]:
%sql {ej_12}

 * mysql+pymysql://root:***@localhost:3306/sakila
16 rows affected.

[('Music', 51),
 ('Horror', 56),
 ('Classics', 57),
 ('Travel', 57),
 ('Comedy', 58),
 ('Children', 60),
 ('Games', 61),
 ('Sci-Fi', 61),
 ('Drama', 62),
 ('New', 63),
 ('Action', 64),
 ('Animation', 66),
 ('Documentary', 68),
 ('Family', 69),
 ('Foreign', 73),
 ('Sports', 74)]